app/Modules/Auth/Models/UserModel.php

SELECT *
FROM `pengguna`
WHERE `nama_pengguna` = 'admin'
AND `status` = 'AKTIF'
 LIMIT 1
---
    public function findByUsername(string $username)
    {
        return $this->where('nama_pengguna', $username)
                    ->where('status', 'AKTIF')
                    ->first();